Revit 2027 API
ElementMulticlassFilter(IList<Type>) Constructor
 Constructs a new instance of a filter to find elements whose Element subclasses matches any of a given set of input classes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementMulticlassFilter(
	IList<Type> typeList
)
Public Sub New (
	typeList As IList(Of Type)
)
public:
ElementMulticlassFilter(
	IList<Type^>^ typeList
)
new :
        typeList : IList<Type> -> ElementMulticlassFilter
Parameters
typeList IList<Type>
 The list of Element subclass types to match.
Exceptions
Exception | Condition
ArgumentException |  One or more input types are not valid subclasses of Element for this filter. -or- One or more of the types do not exist in Revit's native object model.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementMulticlassFilter Class
ElementMulticlassFilter Overload
Autodesk.Revit.DB Namespace